apps/server/src/modules/board/loadtest/scenarios/6createCard_6UpdateTitle.yml
config:
  target: '{{ target }}'
  engines:
    socketio:
      transport: ['websocket', 'polling']
      path: '/board-collaboration'
    socketio-v3:
      path: '/board-collaboration'
      timeout: 1000000
      extraHeaders:
        Cookie: 'jwt={{ token }}'

  phases:
    - duration: 2
      arrivalRate: 50

scenarios:
  - name: create card
    engine: socketio-v3
    socketio:
      extraHeaders:
        Cookie: 'jwt={{ token }}'
    socketio-v3:
      extraHeaders:
        Cookie: 'jwt={{ token }}'
    flow:
      - think: 1

      - emit:
          channel: 'create-column-request'
          data:
            boardId: '{{ board_id }}'
        response:
          on: 'create-column-success'
          capture:
            - json: $.newColumn.id
              as: columnId

      - think: 2

      - loop:
          - emit:
              channel: 'create-card-request'
              data:
                columnId: '{{ columnId}}'
            response:
              on: 'create-card-success'
              capture:
                - json: $.newCard.id
                  as: cardId

          - think: 1

          - emit:
              channel: 'fetch-card-request'
              data:
                cardIds:
                  - '{{ cardId }}'

          - think: 2

          - emit:
              channel: 'update-card-title-request'
              data:
                cardId: '{{ cardId }}'
                newTitle: 'Card {{ cardId}}'

          - think: 1

        count: 6